<div class="grid grid-cols-3 bg-secondary">
    <div class="col-span-2 flex bg-login-register bg-cover bg-no-repeat blur-2xl relative"></div>
    <div class="flex items-center top-14 left-28 absolute z-20">
        <div>
            <svg width="29" height="32" viewBox="0 0 29 32" fill="none" xmlns="http://www.w3.org/2000/svg">
            <g clip-path="url(#clip0_3106_472)">
                <path d="M14.7084 31.8911C14.6411 31.9353 14.5624 31.9589 14.4819 31.9589C14.4013 31.9589 14.3226 31.9353 14.2553 31.8911L6.40261 26.7507C6.34558 26.7125 6.29885 26.6608 6.26654 26.6004C6.23421 26.5398 6.21731 26.4722 6.21731 26.4034C6.21731 26.3346 6.23421 26.2672 6.26654 26.2067C6.29885 26.1461 6.34558 26.0943 6.40261 26.0562L28.3226 11.7016C28.3853 11.6615 28.4576 11.6388 28.5319 11.6356C28.6062 11.6324 28.6803 11.6489 28.7463 11.6834C28.8135 11.718 28.8702 11.7703 28.9101 11.8347C28.9499 11.899 28.9717 11.9731 28.9728 12.0488V22.3319C28.9728 22.4009 28.9558 22.4689 28.923 22.5296C28.8901 22.5902 28.8425 22.6416 28.7848 22.6792L14.7084 31.8911ZM2.77761 24.3768C2.84529 24.4201 2.9239 24.443 3.00417 24.443C3.08444 24.443 3.16304 24.4201 3.23074 24.3768L28.7757 7.64826C28.8335 7.61072 28.8811 7.55927 28.9139 7.49863C28.9468 7.43797 28.9637 7.37002 28.9637 7.30103V0.601437C28.9637 0.491289 28.92 0.385664 28.8423 0.307777C28.7646 0.229888 28.659 0.186128 28.5491 0.186128H23.0777C22.997 0.185904 22.9182 0.209579 22.8511 0.254196L0.194813 15.0945C0.137151 15.1322 0.0898028 15.1836 0.0569725 15.2443C0.0241423 15.3049 0.00684651 15.3728 0.00674821 15.4417V22.3319C0.00664177 22.4009 0.023792 22.4689 0.0566406 22.5296C0.0894892 22.5902 0.137007 22.6416 0.194813 22.6792L2.77761 24.3768ZM0 10.6939C0.000106501 10.7687 0.0203626 10.8421 0.0586319 10.9063C0.0969012 10.9705 0.151716 11.0231 0.217381 11.0587C0.283045 11.0943 0.357081 11.1114 0.431663 11.1083C0.506247 11.1052 0.578675 11.082 0.64119 11.0411L16.0474 0.948678C16.122 0.899675 16.1787 0.827893 16.2093 0.744003C16.2399 0.660111 16.2427 0.568584 16.2173 0.482976C16.1918 0.397368 16.1395 0.322243 16.0681 0.268769C15.9967 0.215296 15.91 0.186323 15.8209 0.186128H0.414627C0.304665 0.186128 0.199111 0.229888 0.121357 0.307777C0.0436026 0.385664 0 0.491289 0 0.601437V10.6939Z" fill="#C4F120"/>
            </g>
            <defs>
                <clipPath id="clip0_3106_472">
                    <rect width="29" height="32" fill="white"/>
                </clipPath>
            </defs>
            </svg>
        </div>
        <div class="pl-2 text-heading font-extrabold text-content-primary tracking-wide">GUARD</div>
    </div>
    <div class="hero min-h-screen py-10 px-20 relative">
        <div class="text-small text-content-body top-0 right-[14%] absolute">
            Já tem uma conta? <a href="/login" class="btn btn-link text-small text-brand p-0">Acessar conta</a>
        </div>
        <div class="hero-content w-full p-0">
            <form method="post" action="/registrar" class="w-full">
                <?php $validacoes = flash()->get('validacoes'); ?>
                <div class="card">
                    <div class="card-body p-0 gap-5">
                        <div class="card-title text-heading text-content-primary leading-heading">Criar conta</div>
                        <?php require base_path('views/partials/_mensage.view.php'); ?>
                        <label class="form-control">
                            <div class="label">
                                <span class="label-text text-label-medium text-content-primary">Nome</span>
                            </div>
                            <input
                                type="text"
                                name="nome"
                                value="<?= old('nome') ?>"
                                placeholder="Digite o seu nome"
                                class="input bg-secondary border-primary text-content-placeholder w-full" />
                            <?php if (isset($validacoes['nome'])) { ?>
                                <div class="label justify-start gap-1 text-xs text-medium leading-small text-red">
                                    <svg width="16" height="16" viewBox="0 0 24 24" class="fill-red" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M12 13.4L14.9 16.3C15.0833 16.4833 15.3167 16.575 15.6 16.575C15.8833 16.575 16.1167 16.4833 16.3 16.3C16.4833 16.1167 16.575 15.8833 16.575 15.6C16.575 15.3167 16.4833 15.0833 16.3 14.9L13.4 12L16.3 9.1C16.4833 8.91667 16.575 8.68333 16.575 8.4C16.575 8.11667 16.4833 7.88333 16.3 7.7C16.1167 7.51667 15.8833 7.425 15.6 7.425C15.3167 7.425 15.0833 7.51667 14.9 7.7L12 10.6L9.1 7.7C8.91667 7.51667 8.68333 7.425 8.4 7.425C8.11667 7.425 7.88333 7.51667 7.7 7.7C7.51667 7.88333 7.425 8.11667 7.425 8.4C7.425 8.68333 7.51667 8.91667 7.7 9.1L10.6 12L7.7 14.9C7.51667 15.0833 7.425 15.3167 7.425 15.6C7.425 15.8833 7.51667 16.1167 7.7 16.3C7.88333 16.4833 8.11667 16.575 8.4 16.575C8.68333 16.575 8.91667 16.4833 9.1 16.3L12 13.4ZM12 22C10.6167 22 9.31667 21.7375 8.1 21.2125C6.88333 20.6875 5.825 19.975 4.925 19.075C4.025 18.175 3.3125 17.1167 2.7875 15.9C2.2625 14.6833 2 13.3833 2 12C2 10.6167 2.2625 9.31667 2.7875 8.1C3.3125 6.88333 4.025 5.825 4.925 4.925C5.825 4.025 6.88333 3.3125 8.1 2.7875C9.31667 2.2625 10.6167 2 12 2C13.3833 2 14.6833 2.2625 15.9 2.7875C17.1167 3.3125 18.175 4.025 19.075 4.925C19.975 5.825 20.6875 6.88333 21.2125 8.1C21.7375 9.31667 22 10.6167 22 12C22 13.3833 21.7375 14.6833 21.2125 15.9C20.6875 17.1167 19.975 18.175 19.075 19.075C18.175 19.975 17.1167 20.6875 15.9 21.2125C14.6833 21.7375 13.3833 22 12 22Z"/>
                                    </svg>
                                    <?= $validacoes['nome'][0] ?>
                                </div>
                            <?php } ?>
                        </label>
                        <label class="form-control">
                            <div class="label">
                                <span class="label-text text-label-medium text-content-primary">Email</span>
                            </div>
                            <input
                                type="text"
                                name="email"
                                value="<?= old('email') ?>"
                                placeholder="Digite o seu email"
                                class="input bg-secondary border-primary text-content-placeholder w-full" />
                            <?php if (isset($validacoes['email'])) { ?>
                                <div class="label justify-start gap-1 text-xs text-medium leading-small text-red">
                                    <svg width="16" height="16" viewBox="0 0 24 24" class="fill-red" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M12 13.4L14.9 16.3C15.0833 16.4833 15.3167 16.575 15.6 16.575C15.8833 16.575 16.1167 16.4833 16.3 16.3C16.4833 16.1167 16.575 15.8833 16.575 15.6C16.575 15.3167 16.4833 15.0833 16.3 14.9L13.4 12L16.3 9.1C16.4833 8.91667 16.575 8.68333 16.575 8.4C16.575 8.11667 16.4833 7.88333 16.3 7.7C16.1167 7.51667 15.8833 7.425 15.6 7.425C15.3167 7.425 15.0833 7.51667 14.9 7.7L12 10.6L9.1 7.7C8.91667 7.51667 8.68333 7.425 8.4 7.425C8.11667 7.425 7.88333 7.51667 7.7 7.7C7.51667 7.88333 7.425 8.11667 7.425 8.4C7.425 8.68333 7.51667 8.91667 7.7 9.1L10.6 12L7.7 14.9C7.51667 15.0833 7.425 15.3167 7.425 15.6C7.425 15.8833 7.51667 16.1167 7.7 16.3C7.88333 16.4833 8.11667 16.575 8.4 16.575C8.68333 16.575 8.91667 16.4833 9.1 16.3L12 13.4ZM12 22C10.6167 22 9.31667 21.7375 8.1 21.2125C6.88333 20.6875 5.825 19.975 4.925 19.075C4.025 18.175 3.3125 17.1167 2.7875 15.9C2.2625 14.6833 2 13.3833 2 12C2 10.6167 2.2625 9.31667 2.7875 8.1C3.3125 6.88333 4.025 5.825 4.925 4.925C5.825 4.025 6.88333 3.3125 8.1 2.7875C9.31667 2.2625 10.6167 2 12 2C13.3833 2 14.6833 2.2625 15.9 2.7875C17.1167 3.3125 18.175 4.025 19.075 4.925C19.975 5.825 20.6875 6.88333 21.2125 8.1C21.7375 9.31667 22 10.6167 22 12C22 13.3833 21.7375 14.6833 21.2125 15.9C20.6875 17.1167 19.975 18.175 19.075 19.075C18.175 19.975 17.1167 20.6875 15.9 21.2125C14.6833 21.7375 13.3833 22 12 22Z"/>
                                    </svg>
                                    <?= $validacoes['email'][0] ?>
                                </div>
                            <?php } ?>
                        </label>
                        <label class="form-control">
                            <div class="label">
                                <span class="label-text text-label-medium text-content-primary">Confirmar Email</span>
                            </div>
                            <input
                                type="text"
                                name="email_confirm"
                                placeholder="Confirme o seu email"
                                class="input bg-secondary border-primary text-content-placeholder w-full" />
                        </label>
                        <label class="form-control">
                            <div class="label">
                                <span class="label-text text-label-medium text-content-primary">Senha</span>
                            </div>
                            <input type="password" name="senha" placeholder="Insira sua senha" class="input bg-secondary border-primary text-content-placeholder w-full" />
                            <?php if (isset($validacoes['senha'])) { ?>
                                <div class="label justify-start gap-1 text-xs text-medium leading-small text-red">
                                    <svg width="16" height="16" viewBox="0 0 24 24" class="fill-red" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M12 13.4L14.9 16.3C15.0833 16.4833 15.3167 16.575 15.6 16.575C15.8833 16.575 16.1167 16.4833 16.3 16.3C16.4833 16.1167 16.575 15.8833 16.575 15.6C16.575 15.3167 16.4833 15.0833 16.3 14.9L13.4 12L16.3 9.1C16.4833 8.91667 16.575 8.68333 16.575 8.4C16.575 8.11667 16.4833 7.88333 16.3 7.7C16.1167 7.51667 15.8833 7.425 15.6 7.425C15.3167 7.425 15.0833 7.51667 14.9 7.7L12 10.6L9.1 7.7C8.91667 7.51667 8.68333 7.425 8.4 7.425C8.11667 7.425 7.88333 7.51667 7.7 7.7C7.51667 7.88333 7.425 8.11667 7.425 8.4C7.425 8.68333 7.51667 8.91667 7.7 9.1L10.6 12L7.7 14.9C7.51667 15.0833 7.425 15.3167 7.425 15.6C7.425 15.8833 7.51667 16.1167 7.7 16.3C7.88333 16.4833 8.11667 16.575 8.4 16.575C8.68333 16.575 8.91667 16.4833 9.1 16.3L12 13.4ZM12 22C10.6167 22 9.31667 21.7375 8.1 21.2125C6.88333 20.6875 5.825 19.975 4.925 19.075C4.025 18.175 3.3125 17.1167 2.7875 15.9C2.2625 14.6833 2 13.3833 2 12C2 10.6167 2.2625 9.31667 2.7875 8.1C3.3125 6.88333 4.025 5.825 4.925 4.925C5.825 4.025 6.88333 3.3125 8.1 2.7875C9.31667 2.2625 10.6167 2 12 2C13.3833 2 14.6833 2.2625 15.9 2.7875C17.1167 3.3125 18.175 4.025 19.075 4.925C19.975 5.825 20.6875 6.88333 21.2125 8.1C21.7375 9.31667 22 10.6167 22 12C22 13.3833 21.7375 14.6833 21.2125 15.9C20.6875 17.1167 19.975 18.175 19.075 19.075C18.175 19.975 17.1167 20.6875 15.9 21.2125C14.6833 21.7375 13.3833 22 12 22Z"/>
                                    </svg>
                                    <?= $validacoes['senha'][0] ?>
                                </div>
                            <?php } ?>
                        </label>
                        <div class="card-actions justify-end">
                            <button class="btn btn-primary bg-brand border-brand text-content-inverse hover:bg-tertiary hover:text-content-primary hover:border-primary">Criar conta</button>
                        </div>
                    </div>
                </div>
            </form>
        </div>
    </div>
</div>